app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "rating", "read", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 27 Feb 2014 22:10:58 UTC +00:00], ["rating", 5], ["read", true], ["title", "The hithikers guide to the galaxy"], ["updated_at", Thu, 27 Feb 2014 22:10:58 UTC +00:00]]
---
  def create

    if params[:book][:img_data]
      data = params[:book][:img_data].read
      original_filename = params[:book][:img_data].original_filename
      content_type = params[:book][:img_data].content_type
    end
    @book = Book.new(book_params) do |t|

      t.img_data      = data
      t.img_filename  = original_filename
      t.img_mime_type = content_type
    end

    if @book.save